app/controllers/products_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "products".* FROM "products" WHERE "products"."user_id" = 1
---
  def persona
    @user = User.find(params[:id])
    @productos = Product.where(user: @user)